In [1]:
import numpy as np
import pandas as pd

In [2]:
lista = list('abcdf')
lista

['a', 'b', 'c', 'd', 'f']

In [4]:
first_series = pd.Series(lista)
print(first_series)

0    a
1    b
2    c
3    d
4    f
dtype: object

In [5]:
np_country = np.array(['Luxembourg', 'Norway', 'Japan', 'Switzerland', 'United States', 'Qatar', 'Iceland', 'Sewden', 'Singapore', 'Denmark'])

In [6]:
s_country = pd.Series(np_country)

In [7]:
print(s_country)

0       Luxembourg
1           Norway
2            Japan
3      Switzerland
4    United States
5            Qatar
6          Iceland
7           Sewden
8        Singapore
9          Denmark
dtype: object

In [8]:
dict_country_gdp = pd.Series([2255.225482,629.9553062,11601.63022,25306.82494,27266.40335,19466.99052,588.3691778,
                              2890.345675,24733.62696,1445.760002,4803.398244,2618.876037,590.4521124,665.7982328,
                              7122.938458,2639.54156,3362.4656,15378.16704,30860.12808,2579.115607,6525.541272,
                              229.6769525,2242.689259,27570.4852,23016.84778,1334.646773,402.6953275,6047.200797,
                              394.1156638,385.5793827,1414.072488,5745.981529,837.7464011,1206.991065,27715.52837,
                              18937.24998,39578.07441,478.2194906,16684.21278,279.2204061,5345.213415,6288.25324,
                              1908.304416,274.8728621,14646.42094,40034.85063,672.1547506,3359.517402,36152.66676,
                              3054.727742,33529.83052,3825.093781,15428.32098,33630.24604,39170.41371,2699.123242,
                              21058.43643,28272.40661,37691.02733,9581.05659,5671.912202,757.4009286,347.7456605],
                             index=['Algeria','Angola','Argentina','Australia','Austria','Bahamas','Bangladesh',
                                    'Belarus','Belgium','Bhutan','Brazil','Bulgaria','Cambodia','Cameroon','Chile',
                                    'China','Colombia','Cyprus','Denmark','El Salvador','Estonia','Ethiopia','Fiji',
                                    'Finland','France','Georgia','Ghana','Grenada','Guinea','Haiti','Honduras',
                                    'Hungary','India','Indonesia','Ireland','Italy','Japan','Kenya', 'South Korea',
                                    'Liberia','Malaysia','Mexico', 'Morocco','Nepal','New Zealand','Norway','Pakistan',
                                    'Peru','Qatar','Russia','Singapore','South Africa','Spain','Sweden','Switzerland',
                                    'Thailand', 'United Arab Emirates','United Kingdom','United States','Uruguay',
                                    'Venezuela','Vietnam','Zimbabwe'])
print(dict_country_gdp)

Algeria           2255.225482
Angola             629.955306
Argentina        11601.630220
Australia        25306.824940
Austria          27266.403350
                     ...
United States    37691.027330
Uruguay           9581.056590
Venezuela         5671.912202
Vietnam            757.400929
Zimbabwe           347.745660
Length: 63, dtype: float64

In [10]:
#Print series with scalar input
scalar_series = pd.Series(5., index=list('abcde'))
scalar_series

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [11]:
#access elements in the series
dict_country_gdp[0]

2255.225482

In [12]:
#access first 5 countries from the series
dict_country_gdp[0:5]

Algeria       2255.225482
Angola         629.955306
Argentina    11601.630220
Australia    25306.824940
Austria      27266.403350
dtype: float64

In [13]:
#look up a country by name or index
dict_country_gdp.loc['United States']

37691.02733

In [14]:
#Look up by position
dict_country_gdp.iloc[3]

25306.82494

In [17]:
first_vector_series = pd.Series([1,2,3,4], index = list('abcd'))
second_vector_series = pd.Series([10,20,30,40], index=list('adbc'))
print(first_vector_series)
print(second_vector_series)

a    1
b    2
c    3
d    4
dtype: int64
a    10
d    20
b    30
c    40
dtype: int64

In [18]:
first_vector_series + second_vector_series

a    11
b    32
c    43
d    24
dtype: int64

In [19]:
second_vector_series = pd.Series([10,20,30,40], index=list('adef'))

In [20]:
first_vector_series + second_vector_series

a    11.0
b     NaN
c     NaN
d    24.0
e     NaN
f     NaN
dtype: float64

In [21]:
#Create a data frame
#Last five olympics data: place, year and number of countries participated
olympic_data_list = {'HostCity': ['London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'],
                    'Year': [2012,2008,2004,2000,1996],
                    'No. of Participating Countries': [205,204,201,200,197]
                    }
type(olympic_data_list)

dict

In [22]:
print(olympic_data_list)

{'HostCity': ['London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'], 'Year': [2012, 2008, 2004, 2000, 1996], 'No. of Participating Countries': [205, 204, 201, 200, 197]}

In [24]:
df_olympic_data = pd.DataFrame(olympic_data_list)

In [25]:
df_olympic_data

  HostCity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197

In [30]:
olympic_data_dict = {'London':{2012:205}, 'Beijing': {2008:204}}
olympic_data_dict

{'London': {2012: 205}, 'Beijing': {2008: 204}}

In [27]:
df_olympic_data_dict = pd.DataFrame(olympic_data_dict)

In [28]:
df_olympic_data_dict

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

In [31]:
df_olympic_data.HostCity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [32]:
#use describe function to display the content
df_olympic_data.describe

<bound method NDFrame.describe of   HostCity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197>

In [33]:
olympic_series_participation = pd.Series([205,204,201,200,197], index=[2012,2008,2004,2000,1996])
olympic_series_country = pd.Series(['London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'], index=[2012,2008,2004,2000,1996])

In [34]:
df_olympic_series=pd.DataFrame({'No of participating countries': olympic_series_participation,
                               'Host cities': olympic_series_country})

In [35]:
df_olympic_series

      No of participating countries Host cities
2012                            205      London
2008                            204     Beijing
2004                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta

In [36]:
np_array = np.array([2012,2008,2004,2000,1996])
dict_ndarray = {'year': np_array}

In [37]:
df_ndarray = pd.DataFrame(dict_ndarray)

In [38]:
df_ndarray

   year
0  2012
1  2008
2  2004
3  2000
4  1996

In [39]:
df_from_df = pd.DataFrame(df_olympic_series)

In [40]:
df_from_df

      No of participating countries Host cities
2012                            205      London
2008                            204     Beijing
2004                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta